ruby_technical_interview/datarockets/webapp/app/controllers/history_controller.rb

SELECT "histories".* FROM "histories"
SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT ?  [["LIMIT", 1]]
---
  def index
    @history = History.all()
    @user = User.first() # assuming a single user for this project