ruby_technical_interview/datarockets/webapp/app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)
    if @post.save
      # send an email
      PostsMailer.with(post: @post).confirm().deliver_later()

      # create a history record
      History.create(typeof: "postcreation", user: "#{User.first()}")
---
INSERT INTO "posts" ("author", "title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["author", ""], ["title", ""], ["body", ""], ["created_at", "2023-05-31 16:00:56.207329"], ["updated_at", "2023-05-31 16:00:56.207329"]]
INSERT INTO "histories" ("typeof", "user", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["typeof", "postcreation"], ["user", "#<User:0x00007f0228fe0f48>"], ["created_at", "2023-06-05 04:58:55.246364"], ["updated_at", "2023-06-05 04:58:55.246364"]]
SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT ?  [["LIMIT", 1]]