ruby_technical_interview/datarockets/webapp/app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "DataRocketman"], ["email", "ravshan.personal@gmail.com"], ["created_at", "2023-06-04 19:14:41.300249"], ["updated_at", "2023-06-04 19:14:41.300249"]]
---
  def create
    @user = User.new(user_params)
    if @user.save