ruby_technical_interview/datarockets/webapp/app/mailers/posts_mailer.rb

SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT ?  [["LIMIT", 1]]
---
  def confirm
    @user = User.first() # assuming only one recipient